Revit 2027 API
NurbsSurfaceData.GetNumberOfControlPoints Method
 Get the number of control points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfControlPoints()
Public Function GetNumberOfControlPoints As Integer
public:
int GetNumberOfControlPoints()
member GetNumberOfControlPoints : unit -> int
Return Value
Int32
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace